## Plan Result (prod_mgmt)




<pre><code>Plan: 27 to add, 0 to change, 0 to destroy.</code></pre>

* Create
  * module.data_mgmt_zone.azurerm_key_vault_access_policy.purview
  * module.data_mgmt_zone.azurerm_private_endpoint.kv_endpoint
  * module.data_mgmt_zone.azurerm_private_endpoint.purview_endpoint[&#34;account&#34;]
  * module.data_mgmt_zone.azurerm_private_endpoint.purview_endpoint[&#34;blob&#34;]
  * module.data_mgmt_zone.azurerm_private_endpoint.purview_endpoint[&#34;namespace&#34;]
  * module.data_mgmt_zone.azurerm_private_endpoint.purview_endpoint[&#34;portal&#34;]
  * module.data_mgmt_zone.azurerm_private_endpoint.purview_endpoint[&#34;queue&#34;]
  * module.data_mgmt_zone.azurerm_private_endpoint.synapse_private_link_hub_endpoint
  * module.data_mgmt_zone.azurerm_purview_account.this[0]
  * module.data_mgmt_zone.azurerm_resource_group.new[0]
  * module.data_mgmt_zone.azurerm_role_assignment.name[0]
  * module.data_mgmt_zone.azurerm_synapse_private_link_hub.this
  * module.data_mgmt_zone.azurerm_user_assigned_identity.this
  * module.data_mgmt_zone.module.key_vault.azurerm_key_vault.kv
  * module.data_mgmt_zone.module.key_vault.azurerm_key_vault_access_policy.product_team_access_policy
  * module.data_mgmt_zone.module.key_vault.azurerm_monitor_diagnostic_setting.kv-ds
  * module.data_mgmt_zone.module.networking.azurerm_network_security_group.this[&#34;nsg&#34;]
  * module.data_mgmt_zone.module.networking.azurerm_network_security_rule.deny_inbound[&#34;nsg&#34;]
  * module.data_mgmt_zone.module.networking.azurerm_network_security_rule.rules[&#34;nsg-Allow_SDS_PTL_ADO_Agents&#34;]
  * module.data_mgmt_zone.module.networking.azurerm_route.this[&#34;rt-default&#34;]
  * module.data_mgmt_zone.module.networking.azurerm_route_table.this[&#34;rt&#34;]
  * module.data_mgmt_zone.module.networking.azurerm_subnet.this[&#34;vnet-services&#34;]
  * module.data_mgmt_zone.module.networking.azurerm_subnet_network_security_group_association.this[&#34;nsg-vnet-services&#34;]
  * module.data_mgmt_zone.module.networking.azurerm_subnet_route_table_association.this[&#34;rt-vnet-services&#34;]
  * module.data_mgmt_zone.module.networking.azurerm_virtual_network.this[&#34;vnet&#34;]
  * module.data_mgmt_zone.module.vnet_peer_hub.azurerm_virtual_network_peering.initiator_to_target
  * module.data_mgmt_zone.module.vnet_peer_hub.azurerm_virtual_network_peering.target_to_initiator




<details><summary>Change Result (Click me)</summary>

```hcl

  # module.data_mgmt_zone.azurerm_key_vault_access_policy.purview will be created
  + resource "azurerm_key_vault_access_policy" "purview" {
      + id                 = (known after apply)
      + key_vault_id       = (known after apply)
      + object_id          = (known after apply)
      + secret_permissions = [
          + "Get",
          + "List",
          + "Set",
          + "Delete",
          + "Recover",
          + "Backup",
          + "Restore",
          + "Purge",
        ]
      + tenant_id          = (known after apply)
    }

  # module.data_mgmt_zone.azurerm_private_endpoint.kv_endpoint will be created
  + resource "azurerm_private_endpoint" "kv_endpoint" {
      + custom_dns_configs       = (known after apply)
      + id                       = (known after apply)
      + location                 = "uksouth"
      + name                     = "ingest-mgmt-kv-endpoint-prod"
      + network_interface        = (known after apply)
      + private_dns_zone_configs = (known after apply)
      + resource_group_name      = "ingest-mgmt-rg-prod"
      + subnet_id                = (known after apply)
      + tags                     = {
          + "application"  = "dlrm-data-ingest"
          + "builtFrom"    = "hmcts/dlrm-data-ingest-infra"
          + "businessArea" = "cross-cutting"
          + "criticality"  = "High"
          + "environment"  = "production"
        }

      + private_dns_zone_group {
          + id                   = (known after apply)
          + name                 = "endpoint-dnszonegroup"
          + private_dns_zone_ids = [
              + "/subscriptions/1baf5470-1c3e-40d3-a6f7-74bfbce4b348/resourceGroups/core-infra-intsvc-rg/providers/Microsoft.Network/privateDnsZones/privatelink.vaultcore.azure.net",
            ]
        }

      + private_service_connection {
          + is_manual_connection           = false
          + name                           = "ingest-mgmt-kv-endpoint-connection-prod"
          + private_connection_resource_id = (known after apply)
          + private_ip_address             = (known after apply)
          + subresource_names              = [
              + "vault",
            ]
        }
    }

  # module.data_mgmt_zone.azurerm_private_endpoint.purview_endpoint["account"] will be created
  + resource "azurerm_private_endpoint" "purview_endpoint" {
      + custom_dns_configs       = (known after apply)
      + id                       = (known after apply)
      + location                 = "uksouth"
      + name                     = "ingest-mgmt-purview-endpoint-account-prod"
      + network_interface        = (known after apply)
      + private_dns_zone_configs = (known after apply)
      + resource_group_name      = "ingest-mgmt-rg-prod"
      + subnet_id                = (known after apply)
      + tags                     = {
          + "application"  = "dlrm-data-ingest"
          + "builtFrom"    = "hmcts/dlrm-data-ingest-infra"
          + "businessArea" = "cross-cutting"
          + "criticality"  = "High"
          + "environment"  = "production"
        }

      + private_dns_zone_group {
          + id                   = (known after apply)
          + name                 = "endpoint-dnszonegroup"
          + private_dns_zone_ids = [
              + "/subscriptions/1baf5470-1c3e-40d3-a6f7-74bfbce4b348/resourceGroups/core-infra-intsvc-rg/providers/Microsoft.Network/privateDnsZones/privatelink.purview.azure.com",
            ]
        }

      + private_service_connection {
          + is_manual_connection           = false
          + name                           = "ingest-mgmt-purview-endpoint-account-connection-prod"
          + private_connection_resource_id = (known after apply)
          + private_ip_address             = (known after apply)
          + subresource_names              = [
              + "account",
            ]
        }
    }

  # module.data_mgmt_zone.azurerm_private_endpoint.purview_endpoint["blob"] will be created
  + resource "azurerm_private_endpoint" "purview_endpoint" {
      + custom_dns_configs       = (known after apply)
      + id                       = (known after apply)
      + location                 = "uksouth"
      + name                     = "ingest-mgmt-purview-endpoint-blob-prod"
      + network_interface        = (known after apply)
      + private_dns_zone_configs = (known after apply)
      + resource_group_name      = "ingest-mgmt-rg-prod"
      + subnet_id                = (known after apply)
      + tags                     = {
          + "application"  = "dlrm-data-ingest"
          + "builtFrom"    = "hmcts/dlrm-data-ingest-infra"
          + "businessArea" = "cross-cutting"
          + "criticality"  = "High"
          + "environment"  = "production"
        }

      + private_dns_zone_group {
          + id                   = (known after apply)
          + name                 = "endpoint-dnszonegroup"
          + private_dns_zone_ids = [
              + "/subscriptions/1baf5470-1c3e-40d3-a6f7-74bfbce4b348/resourceGroups/core-infra-intsvc-rg/providers/Microsoft.Network/privateDnsZones/privatelink.blob.core.windows.net",
            ]
        }

      + private_service_connection {
          + is_manual_connection           = false
          + name                           = "ingest-mgmt-purview-endpoint-blob-connection-prod"
          + private_connection_resource_id = (known after apply)
          + private_ip_address             = (known after apply)
          + subresource_names              = [
              + "blob",
            ]
        }
    }

  # module.data_mgmt_zone.azurerm_private_endpoint.purview_endpoint["namespace"] will be created
  + resource "azurerm_private_endpoint" "purview_endpoint" {
      + custom_dns_configs       = (known after apply)
      + id                       = (known after apply)
      + location                 = "uksouth"
      + name                     = "ingest-mgmt-purview-endpoint-namespace-prod"
      + network_interface        = (known after apply)
      + private_dns_zone_configs = (known after apply)
      + resource_group_name      = "ingest-mgmt-rg-prod"
      + subnet_id                = (known after apply)
      + tags                     = {
          + "application"  = "dlrm-data-ingest"
          + "builtFrom"    = "hmcts/dlrm-data-ingest-infra"
          + "businessArea" = "cross-cutting"
          + "criticality"  = "High"
          + "environment"  = "production"
        }

      + private_dns_zone_group {
          + id                   = (known after apply)
          + name                 = "endpoint-dnszonegroup"
          + private_dns_zone_ids = [
              + "/subscriptions/1baf5470-1c3e-40d3-a6f7-74bfbce4b348/resourceGroups/core-infra-intsvc-rg/providers/Microsoft.Network/privateDnsZones/privatelink.servicebus.windows.net",
            ]
        }

      + private_service_connection {
          + is_manual_connection           = false
          + name                           = "ingest-mgmt-purview-endpoint-namespace-connection-prod"
          + private_connection_resource_id = (known after apply)
          + private_ip_address             = (known after apply)
          + subresource_names              = [
              + "namespace",
            ]
        }
    }

  # module.data_mgmt_zone.azurerm_private_endpoint.purview_endpoint["portal"] will be created
  + resource "azurerm_private_endpoint" "purview_endpoint" {
      + custom_dns_configs       = (known after apply)
      + id                       = (known after apply)
      + location                 = "uksouth"
      + name                     = "ingest-mgmt-purview-endpoint-portal-prod"
      + network_interface        = (known after apply)
      + private_dns_zone_configs = (known after apply)
      + resource_group_name      = "ingest-mgmt-rg-prod"
      + subnet_id                = (known after apply)
      + tags                     = {
          + "application"  = "dlrm-data-ingest"
          + "builtFrom"    = "hmcts/dlrm-data-ingest-infra"
          + "businessArea" = "cross-cutting"
          + "criticality"  = "High"
          + "environment"  = "production"
        }

      + private_dns_zone_group {
          + id                   = (known after apply)
          + name                 = "endpoint-dnszonegroup"
          + private_dns_zone_ids = [
              + "/subscriptions/1baf5470-1c3e-40d3-a6f7-74bfbce4b348/resourceGroups/core-infra-intsvc-rg/providers/Microsoft.Network/privateDnsZones/privatelink.purview.azure.com",
            ]
        }

      + private_service_connection {
          + is_manual_connection           = false
          + name                           = "ingest-mgmt-purview-endpoint-portal-connection-prod"
          + private_connection_resource_id = (known after apply)
          + private_ip_address             = (known after apply)
          + subresource_names              = [
              + "portal",
            ]
        }
    }

  # module.data_mgmt_zone.azurerm_private_endpoint.purview_endpoint["queue"] will be created
  + resource "azurerm_private_endpoint" "purview_endpoint" {
      + custom_dns_configs       = (known after apply)
      + id                       = (known after apply)
      + location                 = "uksouth"
      + name                     = "ingest-mgmt-purview-endpoint-queue-prod"
      + network_interface        = (known after apply)
      + private_dns_zone_configs = (known after apply)
      + resource_group_name      = "ingest-mgmt-rg-prod"
      + subnet_id                = (known after apply)
      + tags                     = {
          + "application"  = "dlrm-data-ingest"
          + "builtFrom"    = "hmcts/dlrm-data-ingest-infra"
          + "businessArea" = "cross-cutting"
          + "criticality"  = "High"
          + "environment"  = "production"
        }

      + private_dns_zone_group {
          + id                   = (known after apply)
          + name                 = "endpoint-dnszonegroup"
          + private_dns_zone_ids = [
              + "/subscriptions/1baf5470-1c3e-40d3-a6f7-74bfbce4b348/resourceGroups/core-infra-intsvc-rg/providers/Microsoft.Network/privateDnsZones/privatelink.queue.core.windows.net",
            ]
        }

      + private_service_connection {
          + is_manual_connection           = false
          + name                           = "ingest-mgmt-purview-endpoint-queue-connection-prod"
          + private_connection_resource_id = (known after apply)
          + private_ip_address             = (known after apply)
          + subresource_names              = [
              + "queue",
            ]
        }
    }

  # module.data_mgmt_zone.azurerm_private_endpoint.synapse_private_link_hub_endpoint will be created
  + resource "azurerm_private_endpoint" "synapse_private_link_hub_endpoint" {
      + custom_dns_configs       = (known after apply)
      + id                       = (known after apply)
      + location                 = "uksouth"
      + name                     = "ingest-mgmt-synapse-endpoint-prod"
      + network_interface        = (known after apply)
      + private_dns_zone_configs = (known after apply)
      + resource_group_name      = "ingest-mgmt-rg-prod"
      + subnet_id                = (known after apply)
      + tags                     = {
          + "application"  = "dlrm-data-ingest"
          + "builtFrom"    = "hmcts/dlrm-data-ingest-infra"
          + "businessArea" = "cross-cutting"
          + "criticality"  = "High"
          + "environment"  = "production"
        }

      + private_dns_zone_group {
          + id                   = (known after apply)
          + name                 = "endpoint-dnszonegroup"
          + private_dns_zone_ids = [
              + "/subscriptions/1baf5470-1c3e-40d3-a6f7-74bfbce4b348/resourceGroups/core-infra-intsvc-rg/providers/Microsoft.Network/privateDnsZones/privatelink.azuresynapse.net",
            ]
        }

      + private_service_connection {
          + is_manual_connection           = false
          + name                           = "ingest-mgmt-synapse-endpoint-connection-prod"
          + private_connection_resource_id = (known after apply)
          + private_ip_address             = (known after apply)
          + subresource_names              = [
              + "web",
            ]
        }
    }

  # module.data_mgmt_zone.azurerm_purview_account.this[0] will be created
  + resource "azurerm_purview_account" "this" {
      + atlas_kafka_endpoint_primary_connection_string   = (sensitive value)
      + atlas_kafka_endpoint_secondary_connection_string = (sensitive value)
      + catalog_endpoint                                 = (known after apply)
      + guardian_endpoint                                = (known after apply)
      + id                                               = (known after apply)
      + location                                         = "uksouth"
      + managed_resource_group_name                      = "ingest-mgmt-purview-prod"
      + managed_resources                                = (known after apply)
      + name                                             = "ingest-mgmt-purview-prod"
      + public_network_enabled                           = false
      + resource_group_name                              = "ingest-mgmt-rg-prod"
      + scan_endpoint                                    = (known after apply)
      + tags                                             = {
          + "application"  = "dlrm-data-ingest"
          + "builtFrom"    = "hmcts/dlrm-data-ingest-infra"
          + "businessArea" = "cross-cutting"
          + "criticality"  = "High"
          + "environment"  = "production"
        }

      + identity {
          + principal_id = (known after apply)
          + tenant_id    = (known after apply)
          + type         = "SystemAssigned"
        }
    }

  # module.data_mgmt_zone.azurerm_resource_group.new[0] will be created
  + resource "azurerm_resource_group" "new" {
      + id       = (known after apply)
      + location = "uksouth"
      + name     = "ingest-mgmt-rg-prod"
      + tags     = {
          + "application"  = "dlrm-data-ingest"
          + "builtFrom"    = "hmcts/dlrm-data-ingest-infra"
          + "businessArea" = "cross-cutting"
          + "criticality"  = "High"
          + "environment"  = "production"
        }
    }

  # module.data_mgmt_zone.azurerm_role_assignment.name[0] will be created
  + resource "azurerm_role_assignment" "name" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = (known after apply)
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Owner"
      + scope                            = (known after apply)
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.data_mgmt_zone.azurerm_synapse_private_link_hub.this will be created
  + resource "azurerm_synapse_private_link_hub" "this" {
      + id                  = (known after apply)
      + location            = "uksouth"
      + name                = "ingestmgmtsynapsehubprod"
      + resource_group_name = "ingest-mgmt-rg-prod"
      + tags                = {
          + "application"  = "dlrm-data-ingest"
          + "builtFrom"    = "hmcts/dlrm-data-ingest-infra"
          + "businessArea" = "cross-cutting"
          + "criticality"  = "High"
          + "environment"  = "production"
        }
    }

  # module.data_mgmt_zone.azurerm_user_assigned_identity.this will be created
  + resource "azurerm_user_assigned_identity" "this" {
      + client_id           = (known after apply)
      + id                  = (known after apply)
      + location            = "uksouth"
      + name                = "ingest-mgmt-identity-prod"
      + principal_id        = (known after apply)
      + resource_group_name = "ingest-mgmt-rg-prod"
      + tags                = {
          + "application"  = "dlrm-data-ingest"
          + "builtFrom"    = "hmcts/dlrm-data-ingest-infra"
          + "businessArea" = "cross-cutting"
          + "criticality"  = "High"
          + "environment"  = "production"
        }
      + tenant_id           = (known after apply)
    }

  # module.data_mgmt_zone.module.key_vault.azurerm_key_vault.kv will be created
  + resource "azurerm_key_vault" "kv" {
      + access_policy                   = (known after apply)
      + enabled_for_deployment          = true
      + enabled_for_disk_encryption     = true
      + enabled_for_template_deployment = true
      + id                              = (known after apply)
      + location                        = "uksouth"
      + name                            = "ingest-mgmt-kv-prod"
      + public_network_access_enabled   = true
      + purge_protection_enabled        = true
      + resource_group_name             = "ingest-mgmt-rg-prod"
      + sku_name                        = "standard"
      + soft_delete_retention_days      = 90
      + tags                            = {
          + "application"  = "dlrm-data-ingest"
          + "builtFrom"    = "hmcts/dlrm-data-ingest-infra"
          + "businessArea" = "cross-cutting"
          + "criticality"  = "High"
          + "environment"  = "production"
        }
      + tenant_id                       = "531ff96d-0ae9-462a-8d2d-bec7c0b42082"
      + vault_uri                       = (known after apply)

      + network_acls {
          + bypass         = "AzureServices"
          + default_action = "Allow"
        }
    }

  # module.data_mgmt_zone.module.key_vault.azurerm_key_vault_access_policy.product_team_access_policy will be created
  + resource "azurerm_key_vault_access_policy" "product_team_access_policy" {
      + certificate_permissions = [
          + "List",
          + "Update",
          + "Create",
          + "Import",
          + "Delete",
          + "ManageContacts",
          + "ManageIssuers",
          + "GetIssuers",
          + "ListIssuers",
          + "SetIssuers",
          + "DeleteIssuers",
          + "Recover",
        ]
      + id                      = (known after apply)
      + key_permissions         = [
          + "List",
          + "Update",
          + "Create",
          + "Import",
          + "Delete",
          + "Recover",
        ]
      + key_vault_id            = (known after apply)
      + object_id               = "e7ea2042-4ced-45dd-8ae3-e051c6551789"
      + secret_permissions      = [
          + "List",
          + "Set",
          + "Delete",
          + "Recover",
        ]
      + tenant_id               = "531ff96d-0ae9-462a-8d2d-bec7c0b42082"
    }

  # module.data_mgmt_zone.module.key_vault.azurerm_monitor_diagnostic_setting.kv-ds will be created
  + resource "azurerm_monitor_diagnostic_setting" "kv-ds" {
      + id                             = (known after apply)
      + log_analytics_destination_type = (known after apply)
      + log_analytics_workspace_id     = "/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/resourceGroups/oms-automation/providers/Microsoft.OperationalInsights/workspaces/hmcts-prod"
      + name                           = "ingest-mgmt-kv-prod"
      + target_resource_id             = (known after apply)

      + enabled_log {
          + category = "AuditEvent"
        }
    }

  # module.data_mgmt_zone.module.networking.azurerm_network_security_group.this["nsg"] will be created
  + resource "azurerm_network_security_group" "this" {
      + id                  = (known after apply)
      + location            = "uksouth"
      + name                = "ingest-mgmt-nsg-prod"
      + resource_group_name = "ingest-mgmt-rg-prod"
      + security_rule       = (known after apply)
      + tags                = {
          + "application"  = "dlrm-data-ingest"
          + "builtFrom"    = "hmcts/dlrm-data-ingest-infra"
          + "businessArea" = "cross-cutting"
          + "criticality"  = "High"
          + "environment"  = "production"
        }
    }

  # module.data_mgmt_zone.module.networking.azurerm_network_security_rule.deny_inbound["nsg"] will be created
  + resource "azurerm_network_security_rule" "deny_inbound" {
      + access                      = "Deny"
      + description                 = "Default DenyInbound rule"
      + destination_address_prefix  = "*"
      + destination_port_range      = "*"
      + direction                   = "Inbound"
      + id                          = (known after apply)
      + name                        = "DenyAllInbound"
      + network_security_group_name = "ingest-mgmt-nsg-prod"
      + priority                    = 4096
      + protocol                    = "*"
      + resource_group_name         = "ingest-mgmt-rg-prod"
      + source_address_prefix       = "*"
      + source_port_range           = "*"
    }

  # module.data_mgmt_zone.module.networking.azurerm_network_security_rule.rules["nsg-Allow_SDS_PTL_ADO_Agents"] will be created
  + resource "azurerm_network_security_rule" "rules" {
      + access                       = "Allow"
      + description                  = "Allow ADO agents to communicate with DLRM data ingest landing zone resources."
      + destination_address_prefixes = [
          + "10.247.0.0/24",
        ]
      + destination_port_range       = "*"
      + direction                    = "Inbound"
      + id                           = (known after apply)
      + name                         = "nsg-Allow_SDS_PTL_ADO_Agents"
      + network_security_group_name  = "ingest-mgmt-nsg-prod"
      + priority                     = 4000
      + protocol                     = "*"
      + resource_group_name          = "ingest-mgmt-rg-prod"
      + source_address_prefixes      = [
          + "10.147.64.0/20",
          + "10.147.80.0/20",
        ]
      + source_port_range            = "*"
    }

  # module.data_mgmt_zone.module.networking.azurerm_route.this["rt-default"] will be created
  + resource "azurerm_route" "this" {
      + address_prefix         = "0.0.0.0/0"
      + id                     = (known after apply)
      + name                   = "rt-default"
      + next_hop_in_ip_address = "10.11.8.36"
      + next_hop_type          = "VirtualAppliance"
      + resource_group_name    = "ingest-mgmt-rg-prod"
      + route_table_name       = "ingest-mgmt-rt-prod"
    }

  # module.data_mgmt_zone.module.networking.azurerm_route_table.this["rt"] will be created
  + resource "azurerm_route_table" "this" {
      + disable_bgp_route_propagation = false
      + id                            = (known after apply)
      + location                      = "uksouth"
      + name                          = "ingest-mgmt-rt-prod"
      + resource_group_name           = "ingest-mgmt-rg-prod"
      + route                         = (known after apply)
      + subnets                       = (known after apply)
      + tags                          = {
          + "application"  = "dlrm-data-ingest"
          + "builtFrom"    = "hmcts/dlrm-data-ingest-infra"
          + "businessArea" = "cross-cutting"
          + "criticality"  = "High"
          + "environment"  = "production"
        }
    }

  # module.data_mgmt_zone.module.networking.azurerm_subnet.this["vnet-services"] will be created
  + resource "azurerm_subnet" "this" {
      + address_prefixes                               = [
          + "10.247.0.0/24",
        ]
      + enforce_private_link_endpoint_network_policies = (known after apply)
      + enforce_private_link_service_network_policies  = (known after apply)
      + id                                             = (known after apply)
      + name                                           = "ingest-mgmt-services-prod"
      + private_endpoint_network_policies_enabled      = (known after apply)
      + private_link_service_network_policies_enabled  = (known after apply)
      + resource_group_name                            = "ingest-mgmt-rg-prod"
      + virtual_network_name                           = "ingest-mgmt-vnet-prod"
    }

  # module.data_mgmt_zone.module.networking.azurerm_subnet_network_security_group_association.this["nsg-vnet-services"] will be created
  + resource "azurerm_subnet_network_security_group_association" "this" {
      + id                        = (known after apply)
      + network_security_group_id = (known after apply)
      + subnet_id                 = (known after apply)
    }

  # module.data_mgmt_zone.module.networking.azurerm_subnet_route_table_association.this["rt-vnet-services"] will be created
  + resource "azurerm_subnet_route_table_association" "this" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.data_mgmt_zone.module.networking.azurerm_virtual_network.this["vnet"] will be created
  + resource "azurerm_virtual_network" "this" {
      + address_space       = [
          + "10.247.0.0/24",
        ]
      + dns_servers         = (known after apply)
      + guid                = (known after apply)
      + id                  = (known after apply)
      + location            = "uksouth"
      + name                = "ingest-mgmt-vnet-prod"
      + resource_group_name = "ingest-mgmt-rg-prod"
      + subnet              = (known after apply)
      + tags                = {
          + "application"  = "dlrm-data-ingest"
          + "builtFrom"    = "hmcts/dlrm-data-ingest-infra"
          + "businessArea" = "cross-cutting"
          + "criticality"  = "High"
          + "environment"  = "production"
        }
    }

  # module.data_mgmt_zone.module.vnet_peer_hub.azurerm_virtual_network_peering.initiator_to_target will be created
  + resource "azurerm_virtual_network_peering" "initiator_to_target" {
      + allow_forwarded_traffic      = true
      + allow_gateway_transit        = false
      + allow_virtual_network_access = true
      + id                           = (known after apply)
      + name                         = "ingest-mgmt-vnet-prod-to-hub"
      + remote_virtual_network_id    = "/subscriptions/0978315c-75fe-4ada-9d11-1eb5e0e0b214/resourceGroups/hmcts-hub-prod-int/providers/Microsoft.Network/virtualNetworks/hmcts-hub-prod-int"
      + resource_group_name          = "ingest-mgmt-rg-prod"
      + use_remote_gateways          = false
      + virtual_network_name         = "ingest-mgmt-vnet-prod"
    }

  # module.data_mgmt_zone.module.vnet_peer_hub.azurerm_virtual_network_peering.target_to_initiator will be created
  + resource "azurerm_virtual_network_peering" "target_to_initiator" {
      + allow_forwarded_traffic      = true
      + allow_gateway_transit        = false
      + allow_virtual_network_access = true
      + id                           = (known after apply)
      + name                         = "hub-to-ingest-mgmt-vnet-prod"
      + remote_virtual_network_id    = "/subscriptions/e9674938-57cb-43ff-a440-1917658e468c/resourceGroups/ingest-mgmt-rg-prod/providers/Microsoft.Network/virtualNetworks/ingest-mgmt-vnet-prod"
      + resource_group_name          = "hmcts-hub-prod-int"
      + use_remote_gateways          = false
      + virtual_network_name         = "hmcts-hub-prod-int"
    }

Plan: 27 to add, 0 to change, 0 to destroy.
```

</details>





<!-- github-comment: {"Command":"plan","PRNumber":8,"Program":"tfcmt","SHA1":"","Target":"prod_mgmt","Vars":{}} -->